package com.nilecon.musicparkacademy.Model;

import java.util.List;

/**
 * Created by saenza on 4/2/2559.
 */
public class NewsListOject {


    /**
     * News : [{"NewsId":21,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_06_43/8e1d6c979c614bc68749f72e0f80baa0.jpg","Title":"ปรากฏการณ์ของอัญมณี","Description":"ปรากฏการณ์ (Phenomena) เป็นลักษณะพิเศษพบในอัญมณีบางชนิด ลักษณะเหล่านี้อาจเกิดจากลักษณะภายในอัญมณี การเลือกดูดกลืนและการผ่านแสงในพลอย หรือโครงสร้างทางกายภาพของพลอย ปรากฏการณ์ที่พบในอัญมณีมีดังนี้ สาแหรกหรือสตาร์ (Asterism or star) เกิดจากการสะท้อนแสงของตำหนิเส้นเข็มที่ตัดกันมากกว่า 1 ระนาบ พบใน สตาร์ทับทิม สตาร์แซฟไฟร์ และสตาร์แซฟไฟร์สีดำ เป็นต้น ตาแมว (Chatoyancy or cat's eye) เกิดจากการสะท้อนแสงของตำหนิเส้นเข็มที่ขนานกัน 1 ระนาบ พบในคริสโซเบริลตาแมว ควอตซ์ตาแมว และทัวมาลีนตาแมว เป็นต้น อะเวนจูเรสเซนต์ (Aventurescence) เกิดจากการสะท้อนแสงของตำหนิแผ่นแร่มีลักษณะเป็นเกล็ดเล็ก ๆ จะเห็นเป็นเกล็กระยิบระยับ พบในซันสโตนโอลิโกเคลส และอะเวนจูรีนควอตซ์ เป็นต้น การเปลี่ยนสี (Color change) พลอยบางชนิดจะเกิดการเปลี่ยนสี ภายใต้แสงไฟที่แตกต่างกัน ทังนี้จากการเลือกดูดกลืนแสงและการผ่านแสงของพลอย พบใน อเล็กซานไดรด์คริสโซเบริล ซึ่งจะเป็นสีเขียวภายใต้แสงธรรมชาติหรือแสงฟลูออเรสเซนส์ และเห็นเป็นสีแดงภายใต้หลอดไฟไส้ นอกจากนี้ยังพบในแซฟไฟร์เปลี่ยนสี การเล่นสี (Play of color) พบในโอปอลและโอปลอสั่งเคราะห์ เกิดเนื่องจากโครงสร้างภายในประกอบด้วยผลึกซิลิการูปทรงกลม เมื่อแสงแทรกซ้อนผ่านผลึกซิลิกาจะเกิดการหักเหของแสงทำให้เห็นเป็นหย่อมสีต่าง ๆ กับหลายสี แลบบราโดเรสเซนต์ (Labradorescence) เกิดเนื่องจากการสอดแทรกของแสงเข้าไปในชั้นบาง ๆ ของระนาบผลึกแฝด (Repeated twining plane) ทำให้เห็นเป็นแผ่นสีฟ้า-เขียวสลับไปมาบนผิวพลอย พบในแลบบราโดไรต์เฟลด์สปาร์ อะดูลาเรสเซนต์ (Adularescence) เกิดจากการสอดแทรกหรือแตกออกของลำแสงซึ่งสะท้อนจากแผ่นแร่เฟลด์สปาร์ ทำให้เห็นเป็นแผ่นสีขาวหรือฟ้าเหลือบไปมาบนผิวพลอยพบในมูนสโตนออร์โธเคลส เป็นต้น อิริเดสเซนต์ (Iridescence) เกิดจากการสอดแทรกของแสงที่แผ่นฟิล์มบาง ๆ ในเนื้อพลอยทำให้เห็นเป็นสีสเปกตรัม พบในไฟร์อะเกต และไอริสควอตซ์ โอเรียนท์ (Orient) เกิดจากการสอดแทรกและหักเหของแสงจากโครงสร้างที่เป็นชั้น ๆ ของไข่มุกจะเห็นเป็นสีรุ้ง","Banner":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_06_43/8e1d6c979c614bc68749f72e0f80baa0.jpg","CreateDate":"22/01/2016"},{"NewsId":20,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_04_57/e4a34e01d249458299e9eeaaed2ef164.jpg","Title":"การเลือกเครื่องประดับให้เหมาะกับนิ้วมือ","Description":"นิ้วมือที่มีลักษณะนิ้วอวบ มืออวบ คนที่มีนิ้วมืออวบก็ควรจะใส่แหวนที่มีลักษณะหัวแหวนเป็นแนวยาว เช่น รูปทรงหยดนำ้ รูปทรงไข่ เพราะใส่แล้วจะทำให้นิ้วมือยาวขึ้น ดูเรียว และควรจะเลือกที่มีตัวเรือนเรียบ ๆ อาจจะเน้นที่มีสีสันหรือ่อนหวาน นิ้วมือที่มีลักษณะมือสั้น นิ้วสั้น ควรเลือกแหวนที่มีลักษณะทรงกลมหรือหัวใจใหญ่ ๆ หรือเลือกหัวแหวนไม่ยาวมาก ถ้าเลือกใส่ท่ีมีหัวแหวนยาวก็จะทำให้นิ้วมือดูสั้นลงไป  นิ้วมือที่มีลักษณะยาว หรือมือยาว ควรเลือกแหวนที่มีลักษณะเป็นเส้นโค้งเพื่อเพิ่มความอ่อนหวานให้กับเรียวนิ้ว แต่ควรระวังคนที่มีลักษณะนิ้วมือที่มีลักษณะยาว หรือมือยาวจะมีข้อนิ้วที่ใหญ่ เวลาใส่แหวนควรเลือกแหวนที่ใส่แล้วดูเต็มหน้านิ้วเพื่อปกปิดข้อนิ้วที่ใหญ่ด้วย  นิ้วมือมีลักษณะเรียว มือเรียว คนที่มีลักษณะนิ้วเรียว มือเรียว สามารถใส่แหวนได้ทุกรูปทรง ไม่ว่าจเป็นทรงกลม รูปไข่ สี่เหลี่ยม หัวใจ ใส่ได้ทุกรูปแบบ  สำหรับสาวๆที่กำลังมองนิ้วตัวเองอยู่ อย่าเพิ่งท้อใจไป เพราะในปัจุบันมีแหวนให้คุณได้เลือกมากมาย หลากหลายรูปแบบให้เหมาะสมกับนิ้วมือคุณ","Banner":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_04_57/e4a34e01d249458299e9eeaaed2ef164.jpg","CreateDate":"22/01/2016"},{"NewsId":19,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_01_50/506937b9d789441d80da4bcdec061a7e.jpg","Title":"เสน่ห์การฝังอัญมณี","Description":"การฝังอัญมณีนั้นมีมากมายหลายแบบและสวยงามแตกต่างกันออกไปแต่การฝังที่ได้รับความนิยมนั้นมีอยู่ 4 แบบ ต่อไปนี้เราจะมาทำความรู้จักการฝังแต่ละแบบโดยเริ่มที่             1. Prong Setting หรือว่าการฝังแบบหนามเตยวิธีการฝังแบบนี้เป็นฝังแบบชูครับหลายท่านรู้จักกันฮิตสำหรับดีไซน์แหวนหมั้นแหวน  แต่งงานเป็นวิธีการฝังที่ดีที่สุด หนามเตยสำหรับอัญมณีเม็ดใหญ่ๆ แนะนำ 6 หนามเพราะสามารถเกาะอัญมณีได้แน่นหนาและ  ปลอดภัยกว่าช่างจะเซาะร่องที่หนามเตยเพื่อสอดอัญมณีเข้าไปขาที่ใช้เกาะเรียกว่าหนามเตยมีหลายแบบบางครั้งก็ 3, 4 หรือ 6          2. V Prong Setting เตยหัวเรือวิธีนี้เป็นหนามเตยเหมือนกันครับแต่ใช้สำหรับอัญมณีที่มีมุมคือสี่เหลี่ยมมาร์คีส์หัวใจ (ตรงก้นแหลมๆ)  ซึ่งจะปกป้องส่วนที่เปราะบางที่สุดคือส่วนมุมของอัญมณีไม่ให้แตกหรือหักง่ายครับลักษณะจะเหมือนตัวV ภาษาอังกฤษก็เลยเรียกว่า  V Prong Setting ครับ        3. Bezel Setting ฝังหุ้มวิธีการนี้เป็นการที่เราใช้ขอบโลหะหุ้มขอบรอบอัญมณีข้อดีคือทำให้อัญมณีดูเม็ดใหญ่ขึ้นในระยะไกลอย่าง เช่น     75 สตางค์ก็อาจจะดูเป็น 1 กะรัตได้การฝังหุ้มมีข้อดีอีกอย่างก็คือขอบโลหะจะช่วยรักษาตัวอัญมณีไม่ให้ไปกระทบกระแทกวัตถุอื่น ๆ    เวลาสวมใส่รวมทั้งมีพื้นที่ในการยึดเกาะอัญมณีรอบทั้งเม็ดจึงทำให้การฝังหุ้มเป็นการฝังอัญมณีที่แข็งแรงที่สุดในวิธีการฝังทั้งหมดครับแต่    ก็มีข้อเสียคือทำให้อัญมณีไม่ค่อยส่องประกายมากจึงเหมาะแก่แหวนคุณสุภาพบุรุษ        4. Pave Setting (อ่านว่าพาเว) ฝังจิกหรือฝังจิกไข่ปลาเป็นการฝังอัญมณีแบบยอดนิยมเพราะทำให้อัญมณีเม็ดเล็กดูกลืน ๆ ออกมา  เป็นเหมือนอัญมณีแวววาวในพื้นที่ใหญ่ ๆ ซึ่งถ้าใช้อัญมณีที่ Cutting ไม่สวยก็จะเห็นได้ชัดเพราะว่าแหวนที่ทำเสร็จออกมาจะไม่มีประกายเลย  การฝังประเภทนี้ช่างฝังอัญมณีจะขุดพื้นโลหะลงไปเพื่อจิกเป็นหนามเตยขนาดเล็ก ๆ ในการฝังอัญมณี การฝังอัญมณีในรูปแบบต่าง ๆ  ขึ้นอยู่กับความชื่นชอบของแต่ละคนบางคนบอกว่าการฝังแบบหนามเตยดูโบราณแต่บางคนกลับบอกว่าดูคลาสสิกหรือการฝังแบบหุ้ม  บางคนบอกว่าดูสมัยใหม่แต่บางคนก็ว่าจะทำให้ดูอัญมณีเม็ดเล็กลงดังนั้นจึงอยู่ที่คุณเลือกแล้วละครับว่าคุณชอบแบบไหน","Banner":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_01_50/506937b9d789441d80da4bcdec061a7e.jpg","CreateDate":"22/01/2016"},{"NewsId":18,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_00_24/86483bbd6038412aa17ec2d822d3a38e.jpg","Title":"ไข่มุก อัญมณีแห่งสายน้ำ","Description":"  หากพูดถึงไข่มุก คงไม่มีผู้หญิงคนไหนไม่อยากได้มาครอบครอง เนื่องจากไข่มุกเป็นอัญมณีเพียงชนิดเดียวที่เกิดจากสิ่งมีชีวิตซึ่งได้รับความนิยมสูงเสมอมา ไข่มุกเกิดจากการที่หอยมุกเกิดการระคายเคืองเมื่อมีวัตถุแปลกปลอม เช่น กรวดทราย เศษหิน ฯลฯ พัดหลงเข้าไป หอยมุกจะสร้างสารประเภทแคลเซียมคาร์บอเนตมาหุ้มเพื่อลดความระคายเคือง สารนี้จะมีลักษณะเป็นชั้นๆ เรียกว่า เนเคอร์ (nacre) ทำให้ไข่มุกมีความวาว ยิ่งชั้นเนเคอร์หนามาก ก็ยิ่งมีความงามมาก  \t ไข่มุก เป็นอัญมณีที่งดงาม ให้ความรู้สึกที่นุ่มนวล อ่อนโยน ทำให้เมื่ออยู่บนคอที่งามระหงของผู้หญิงจะช่วยให้ผู้สวมใส่ดูสง่างาม ภูมิฐานน่าเชื่อถือ หรูหรา มีรสนิยม เติมเสน่ห์ให้กับหญิงสาว ไข่มุกเป็นอัญมณีที่สามารถใช้สอยได้ทุกโอกาส ไม่ว่าจะเป็นกลางวันหรืองานยามค่ำคืน และสามารถสวมใส่กับเครื่องแต่งกายได้ทุกชุดอย่างงดงามอีกด้วย จึงไม่แปลกใจที่ทุกวันนี้ ผู้หญิงทั่วโลกนิยมสวมใส่มุกเป็นเครื่องประดับมานานกว่าร้อยปี สำหรับสาวๆ ที่ชื่นชอบ หลงเสน่ห์ความเงางามของไข่มุกและอยากจะซื้อสร้อยมุกสวยๆ สักเส้นมาสวมใส่ ควรพิจารณาตามหลักการดังต่อไปนี้              วิธีการเลือกซื้อมุก  1. ความมันวาว ไข่มุกที่ดีจะมีเนื้อมันวาวสดใส ประกายสม่ำเสมอทั้งเม็ด ถ้าความวาวสูงแสดงว่ามีชั้นมุกหนา ทำให้เห็นเหลือบสี (Orient) ของไข่มุก ยิ่งมีความวาวมาก เหลือบสีมาก แสดงว่าเป็นไข่มุกที่ คุณภาพดี ความหนาของชั้นมุกนี้ขึ้นอยู่กับระยะเวลา ดังนั้นสามารถทดสอบได้ว่าไข่มุกมีชั้นมุกหนามากเพียงใดด้วยการดูลักษณะความวาว  2. ลักษณะเนื้อผิว ไข่มุกที่ดีจะต้องมีผิวเรียบเนียนเป็นมันไม่มีรอยขุรขระ ไม่มีรอยถลอก และไม่เป็นฟองอากาศ การเลือกซื้อจึงควรสังเกตอย่างละเอียด โดยอาจใช้ไฟส่องที่ผิวและใช้พื้นหลังสีดำพร้อมกับสังเกตขณะ หมุนไข่มุกเพื่อตรวจสภาพผิวของไข่มุก  3. สี สีของไข่มุก มีอยู่ 2 ประเภท       Body Color ซึ่งเป็นสีของไข่มุกซึ่งจะมีสีขาว สีครีม สีเหลือง เป็นต้น       Overtone ซึ่งเป็นสีเหลือบของไข่มุก อาจมีสีเขียว สีชมพู สีเงิน สีฟ้า เป็นต้น        \t          \t                            สีของไข่มุกขึ้นอยู่กับชนิดของหอยมุกและสภาวะแวดล้อมที่หอยมุกนั้นอาศัยอยู่ สีจะมีผลต่อราคาไข่มุกด้วย ยิ่งไข่มุกที่มีสีที่หายากประกอบกับความมันวาวจะมีราคาสูงมาก  4. ขนาดและรูปร่าง ซึ่งมีผลต่อราคา การเลือกขนาดและรูปร่างขึ้นอยู่กับว่าเราอยากได้ขนาดและรูปร่างแบบไหนและเหมาะกับเครื่องประดับที่ออกแบบไว้หรือไม่ เช่น ถ้าจะซื้อไข่มุกสีเดียวเพื่อมาทำสร้อย ก็ควรเลือกที่มีสีสม่ำเสมอกันและขนาดเท่ากันหรือไล่เรียงกันไป ส่วนไข่มุกรูปร่างแปลกๆ น่าจะเหมาะกับการออกแบบสไตล์เก๋ไก๋ เป็นต้น ขนาดของไข่มุก ยังมีผลต่อบุคลิกของผู้ใส่อีกด้วย หากผู้สวมใส่ยังอายุน้อยก็อาจจะเลือกไข่มุกขนาดไม่ใหญ่มากนัก จะได้ดูน่ารัก ทันสมัย ดั้งนั้นถ้าเรารู้ว่าต้องการไข่มุกขนาดและรูปร่างแบบใดจะทำให้การเลือกซื้อง่ายขึ้น   \t         วิธีดูแล..สร้อยมุกเส้นโปรด            ควรไว้ให้ไกลห่างจากสารเคมีทุกชนิดด้วย เช่น น้ำหอม สเปรย์ ผงซักฟอก ฯลฯ ถ้าจะทำความสะอาดก็ให้ล้างด้วยน้ำสบู่อ่อนๆ และเจือจางมากๆ จากนั้นล้างด้วยน้ำเปล่าจนสะอาดดีใช้ผ้านุ่มๆ ซับให้แห้ง ห้ามเช็ดถูแรงๆ เพราะฝุ่นละอองเล็กๆ ที่ซ่อนอยู่ในผ้าจะไปขูดให้มุกเป็นรอยได้ หากท่านต้องเก็บ ให้เก็บมุกไว้ในถุงผ้าที่มีอากาศถ่ายเทได้ที่สำคัญควรนำสร้อยมุกกลับมาร้อยใหม่ทุก 2 ปี เพราะการสวมสร้อยบ่อยๆ นั้นอาจทำให้เส้นไหมที่ใช้ร้อยเกิดการหย่อน มีช่องว่างระหว่างมุกทำให้ไข่มุกเรียงตัวไม่สวยงามเหมือนเดิม วิธีง่ายๆ แค่นี้คุณก็จะมีเครื่องประดับมุกชุดโปรดไว้สวมใส่อย่างมีรสนิยมตราบนานเท่านาน หวังว่าเทคนิคนี้คงจะช่วยให้สาว ๆ เลือกสร้อยไข่มุกสวย ๆ คุณภาพดี ไปใส่ได้อย่างสบายใจและเหมาะกับตัวเองนะคะ","Banner":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_00_24/86483bbd6038412aa17ec2d822d3a38e.jpg","CreateDate":"22/01/2016"}]
     * Viedo : [{"NewsId":40,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_09_30/30b180339a494f3c8396cd4d4fcbcce3.jpg","Title":"สร้อยข้อมือพลอยธรรมชาติกับราคาที่ช็อคมาก ๆ ","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"OmjRU-5nKS8","CreateDate":"22/01/2016"},{"NewsId":39,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_08_49/6d942b9a3d92458b9701a115d5bcf05a.jpg","Title":"เครื่องประดับ MARISA กับราคาทั้งเซตเพียง 6,500.-","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"z6MSsdvOcOI","CreateDate":"22/01/2016"},{"NewsId":38,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_08_04/156415636be247bbbe4fef6ada34a4e3.jpg","Title":"โปรโมชั่นสุดช็อคกับเครื่องประดับพลอยธรรมชาติ","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"Ql8ZCOcZ_JM","CreateDate":"22/01/2016"},{"NewsId":37,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_07_18/e1074b6d647d4af9b021031f97d75f19.jpg","Title":"รับฟรี!! จี้ Created Tanzanite มูลค่า 2,700.-","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"LaRij62mxo4","CreateDate":"22/01/2016"},{"NewsId":36,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_06_35/7b7a2e3026a249468d3aaf25777970d4.jpg","Title":"สรุปรวมไฮไลท์สินค้าเครื่องประดับสวย ๆ","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"PVLzwE_AdwQ","CreateDate":"22/01/2016"},{"NewsId":35,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_02_30/66844369a8c84fee96c21c37fd041ade.jpg","Title":"แหวนพลอยธรรมชาติขนาดใหญ่","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"GXeImHV7ahs","CreateDate":"22/01/2016"},{"NewsId":34,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_01_41/efb634103a1f45edbb98d0419251cad9.jpg","Title":"สั่งซื้อเครื่องประดับโกเมนธรรมชาติ","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"5unV1lVaueE","CreateDate":"22/01/2016"},{"NewsId":33,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_10_59_39/f09c840dcd254086812435b2ff3cd3c0.jpg","Title":"แหวนพลอยธรรมชาติขนาดใหญ่!!!","Description":" ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html  นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com   ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"4yroo1iekxw","CreateDate":"22/01/2016"},{"NewsId":32,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_10_58_48/44e754c212554d2a877a426354b40f35.jpg","Title":"เซตสังวาลและต่างหูจาก MARISA ","Description":" ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html  นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com   ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"oObuUm1LH2g","CreateDate":"22/01/2016"},{"NewsId":31,"Icon":"http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_10_58_02/8dd2ac511fce430f8ec605a215b4fd85.jpg","Title":"แหวนของสมนาคุณ Red CZiamond","Description":"ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html  นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com   ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ","UrlVideo":"AzeuVO0kaXw","CreateDate":"22/01/2016"}]
     * IsSuccess : true
     * ErrCode : 0
     * ErrMessage :
     */

    private boolean IsSuccess;
    private int ErrCode;
    private String ErrMessage;
    /**
     * NewsId : 21
     * Icon : http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_06_43/8e1d6c979c614bc68749f72e0f80baa0.jpg
     * Title : ปรากฏการณ์ของอัญมณี
     * Description : ปรากฏการณ์ (Phenomena) เป็นลักษณะพิเศษพบในอัญมณีบางชนิด ลักษณะเหล่านี้อาจเกิดจากลักษณะภายในอัญมณี การเลือกดูดกลืนและการผ่านแสงในพลอย หรือโครงสร้างทางกายภาพของพลอย ปรากฏการณ์ที่พบในอัญมณีมีดังนี้ สาแหรกหรือสตาร์ (Asterism or star) เกิดจากการสะท้อนแสงของตำหนิเส้นเข็มที่ตัดกันมากกว่า 1 ระนาบ พบใน สตาร์ทับทิม สตาร์แซฟไฟร์ และสตาร์แซฟไฟร์สีดำ เป็นต้น ตาแมว (Chatoyancy or cat's eye) เกิดจากการสะท้อนแสงของตำหนิเส้นเข็มที่ขนานกัน 1 ระนาบ พบในคริสโซเบริลตาแมว ควอตซ์ตาแมว และทัวมาลีนตาแมว เป็นต้น อะเวนจูเรสเซนต์ (Aventurescence) เกิดจากการสะท้อนแสงของตำหนิแผ่นแร่มีลักษณะเป็นเกล็ดเล็ก ๆ จะเห็นเป็นเกล็กระยิบระยับ พบในซันสโตนโอลิโกเคลส และอะเวนจูรีนควอตซ์ เป็นต้น การเปลี่ยนสี (Color change) พลอยบางชนิดจะเกิดการเปลี่ยนสี ภายใต้แสงไฟที่แตกต่างกัน ทังนี้จากการเลือกดูดกลืนแสงและการผ่านแสงของพลอย พบใน อเล็กซานไดรด์คริสโซเบริล ซึ่งจะเป็นสีเขียวภายใต้แสงธรรมชาติหรือแสงฟลูออเรสเซนส์ และเห็นเป็นสีแดงภายใต้หลอดไฟไส้ นอกจากนี้ยังพบในแซฟไฟร์เปลี่ยนสี การเล่นสี (Play of color) พบในโอปอลและโอปลอสั่งเคราะห์ เกิดเนื่องจากโครงสร้างภายในประกอบด้วยผลึกซิลิการูปทรงกลม เมื่อแสงแทรกซ้อนผ่านผลึกซิลิกาจะเกิดการหักเหของแสงทำให้เห็นเป็นหย่อมสีต่าง ๆ กับหลายสี แลบบราโดเรสเซนต์ (Labradorescence) เกิดเนื่องจากการสอดแทรกของแสงเข้าไปในชั้นบาง ๆ ของระนาบผลึกแฝด (Repeated twining plane) ทำให้เห็นเป็นแผ่นสีฟ้า-เขียวสลับไปมาบนผิวพลอย พบในแลบบราโดไรต์เฟลด์สปาร์ อะดูลาเรสเซนต์ (Adularescence) เกิดจากการสอดแทรกหรือแตกออกของลำแสงซึ่งสะท้อนจากแผ่นแร่เฟลด์สปาร์ ทำให้เห็นเป็นแผ่นสีขาวหรือฟ้าเหลือบไปมาบนผิวพลอยพบในมูนสโตนออร์โธเคลส เป็นต้น อิริเดสเซนต์ (Iridescence) เกิดจากการสอดแทรกของแสงที่แผ่นฟิล์มบาง ๆ ในเนื้อพลอยทำให้เห็นเป็นสีสเปกตรัม พบในไฟร์อะเกต และไอริสควอตซ์ โอเรียนท์ (Orient) เกิดจากการสอดแทรกและหักเหของแสงจากโครงสร้างที่เป็นชั้น ๆ ของไข่มุกจะเห็นเป็นสีรุ้ง
     * Banner : http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_12_06_43/8e1d6c979c614bc68749f72e0f80baa0.jpg
     * CreateDate : 22/01/2016
     */

    private List<NewsEntity> News;
    /**
     * NewsId : 40
     * Icon : http://jewelry-bo.api-nilecon.com/WebApplication/Warehouse/News/Folder_22_01_2559_11_09_30/30b180339a494f3c8396cd4d4fcbcce3.jpg
     * Title : สร้อยข้อมือพลอยธรรมชาติกับราคาที่ช็อคมาก ๆ
     * Description : ช่องทางการรับชม - PSI ช่อง 152 และ 64 - GMM Z ช่อง 63 - DTV ช่อง 58 - True Digital HD ช่อง 804 - True Digital TV ช่อง 804 - สามารถรับชมออนไลน์ผ่านทาง Smartphone และ Tablet ต่างๆ ได้ที่ http://www.jwctv.com/jwctv.html นอกจากนี้ทุกท่านยังสามารถเข้าไปดูรายละเอ­ียดสินค้าเพิ่มเติมได้ที่ www.jwctv.com ***สั่งจองสินค้าโทร.02-105-4093*** หรือจะจองสินค้าผ่านทาง Line ง่าย ๆ เพียงเพิ่มเพื่อนได้ที่ Line ID: @jwcline เท่านี้ท่านก็จองสินค้าที่ท่านชอบได้อย่าง­สะดวกสบายแล้วค่ะ
     * UrlVideo : OmjRU-5nKS8
     * CreateDate : 22/01/2016
     */

    private List<ViedoEntity> Viedo;

    public void setIsSuccess(boolean IsSuccess) {
        this.IsSuccess = IsSuccess;
    }

    public void setErrCode(int ErrCode) {
        this.ErrCode = ErrCode;
    }

    public void setErrMessage(String ErrMessage) {
        this.ErrMessage = ErrMessage;
    }

    public void setNews(List<NewsEntity> News) {
        this.News = News;
    }

    public void setViedo(List<ViedoEntity> Viedo) {
        this.Viedo = Viedo;
    }

    public boolean isIsSuccess() {
        return IsSuccess;
    }

    public int getErrCode() {
        return ErrCode;
    }

    public String getErrMessage() {
        return ErrMessage;
    }

    public List<NewsEntity> getNews() {
        return News;
    }

    public List<ViedoEntity> getViedo() {
        return Viedo;
    }

    public static class NewsEntity {
        private int NewsId;
        private String Icon;
        private String Title;
        private String Description;
        private String Banner;
        private String CreateDate;

        public void setNewsId(int NewsId) {
            this.NewsId = NewsId;
        }

        public void setIcon(String Icon) {
            this.Icon = Icon;
        }

        public void setTitle(String Title) {
            this.Title = Title;
        }

        public void setDescription(String Description) {
            this.Description = Description;
        }

        public void setBanner(String Banner) {
            this.Banner = Banner;
        }

        public void setCreateDate(String CreateDate) {
            this.CreateDate = CreateDate;
        }

        public int getNewsId() {
            return NewsId;
        }

        public String getIcon() {
            return Icon;
        }

        public String getTitle() {
            return Title;
        }

        public String getDescription() {
            return Description;
        }

        public String getBanner() {
            return Banner;
        }

        public String getCreateDate() {
            return CreateDate;
        }
    }

    public static class ViedoEntity {
        private int NewsId;
        private String Icon;
        private String Title;
        private String Description;
        private String UrlVideo;
        private String CreateDate;

        public void setNewsId(int NewsId) {
            this.NewsId = NewsId;
        }

        public void setIcon(String Icon) {
            this.Icon = Icon;
        }

        public void setTitle(String Title) {
            this.Title = Title;
        }

        public void setDescription(String Description) {
            this.Description = Description;
        }

        public void setUrlVideo(String UrlVideo) {
            this.UrlVideo = UrlVideo;
        }

        public void setCreateDate(String CreateDate) {
            this.CreateDate = CreateDate;
        }

        public int getNewsId() {
            return NewsId;
        }

        public String getIcon() {
            return Icon;
        }

        public String getTitle() {
            return Title;
        }

        public String getDescription() {
            return Description;
        }

        public String getUrlVideo() {
            return UrlVideo;
        }

        public String getCreateDate() {
            return CreateDate;
        }
    }
}
